vagabond/app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.save
---
INSERT INTO "posts" ("title", "content", "photo", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "TEST"], ["content", "test"], ["photo", "null"], ["created_at", "2016-05-06 01:14:51.222916"], ["updated_at", "2016-05-06 01:14:51.222916"]]