vagabond/app/controllers/user_posts_controller.rb

  def show
    # @user = User.find(params[:user_id])
    @post = Post.find_by(id: params[:post_id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 22]]

  def destroy
    post_id = params[:posts_id]
    post = Post.find_by_id(post_id)
    post.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 1]]