vagabond/app/controllers/users_controller.rb

  def create
    @user = User.create(user_params)
---
INSERT INTO "users" ("first_name", "last_name", "email", "location", "password_digest", "photo", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def edit
      user_id = params[:id]
      @user = User.find_by(id: user_id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 15]]

  def update
    user_id = params[:id]
    user = User.find_by(id: user_id)
    if user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 15]]
UPDATE "users" SET "location" = $1, "photo" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["location", ""], ["photo", "https://pbs.twimg.com/profile_images/562466745340817408/_nIu8KHX.jpeg"], ["updated_at", "2016-05-06 17:44:16.441489"], ["id", 15]]