vagabond/app/views/users/show.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1  [["user_id", 3]]
---
  <%end%>
  <% @user.posts.each do |post| %>