vagabond/app/views/user_posts/show.html.erb

<p> <%=@post.content %> </p>
<p> <%=@post.user.first_name %> </p>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 4]]