app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.photo == ""
      @user.photo = "https://lh3.googleusercontent.com/-NIp5BzqFqNE/AAAAAAAAAAI/AAAAAAAAAAA/CapeXh7GWeI/photo.jpg"
    end
    @user.save
---
INSERT INTO "users" ("first_name", "last_name", "email", "password_digest", "photo", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"